export default {
  state: 1,
  msg: 'get successfully!',
  list: {
    market: [
      {
        label: '市场BD',
        count: 10,
        payfor: '6-11k',
        site: '武汉',
        category: 1,
        require: `1、热情开朗，有销售经验优先；（无销售经验可培训）
                  2、热爱销售行业， 有明确的目标和成功的欲望， 具有良好的自我个人管理、 团队协作精神；
                  3、学习能力强， 具备较强的抗压能力和执行力， 敢于承担责任， 有良好的职业操守。`,
        content: `
          1、 负责产品的销售推广工作；
          2、 开发新客户， 维护老客户， 协助售后技术人员解决客户问题；
          3、 制定销售计划， 完成销售指标。
        `
      },
      {
        label: '专送员',
        count: 10,
        payfor: '4-8k',
        site: '武汉',
        category: 1,
        require: `
          1、 年龄55岁以下， 吃苦耐劳， 人品端正， 做事勤奋， 仔细认真；
          2、 熟悉武汉市的路线
          3、 有较强的服务意识和责任心。
        `,
        content: `
          1、负责区域内的帮买、 帮送业务
        `
      }
    ],

    operation: [
      {
        label: '用户运营',
        count: 1,
        payfor: '4-8k',
        site: '武汉',
        category: 2,
        require: `
          1. 具备互联网C端用户增长、 用户运营相关工作经验
          2. 数据驱动， 分析能力强
          3. 具备用户思维洞察力， 善于寻找各种方法实现增长目标
        `,
        content: `
          1. 负责搭建、 运营用户社群， 完成拉新到转化的整体流程
          2. 负责项目在得意生活、 大众点评等平台上的运营， 制定多样运营策略获取意向用户
          3. 了解并准确把握用户需求， 掌握竞争对手产品改进及运营方式动态， 进行优化
        `
      },
      {
        label: '新媒体运营',
        count: 1,
        payfor: '6-8k',
        site: '武汉',
        category: 2,
        require: `
          1. 有3年以上微信运营推广经验, 具有成熟的微信推广思维， 较强的信息搜索、 筛选和编辑能力， 有较强的文字 + 图片编辑能力；
          2. 擅长微信线上活动推广增粉， 能够提供本人的公众号推广和增粉的案例；
          3. 熟悉公众号的常规手段；
          4. 具备良好的沟通能力和团队合作精神， 责任感、 执行力、 创新力强；
        `,
        content: `
          1. 负责公司微信公众号（ 情感、 职场类） 运营， 根据公众号的属性撰写各种符合优质、 有传播性的内容， 对微信公众号关注度及内容效果负责；
          2. 负责微信公众号的推广， 包括进行公众号的合作推广和行业内公众号的互动增粉
          3. 制定微信公众号运营策略， 策划相关线上推广活动， 与粉丝互动， 有效提升粉丝数量
          4. 负责微信公众内容规划， 捕捉行业热点话题、 行业热点话题快速反应， 完成专题策划、 设计、 日常内容编辑、 撰写、 发布
          5. 跟踪微信推广效果， 分析数据及反馈
        `
      }
    ],

    technology: [
      {
        label: '安卓开发工程师',
        count: 6,
        payfor: '10-20k',
        site: '武汉',
        category: 3,
        require: `  
          1 大专及以上学历， 计算机或相关专业
          2 三年以上 Android 开发经验， 熟练掌握 Java 语言；
          3 熟悉 Android Framework， 理解 Android 系统机制， 了解Android root原理；
          4 熟悉常用设计模式， 有良好的编码习惯；
          5 熟悉移动网络通信机制， 对 Socket 通信， TCP / IP 和 HTTP 有充分理解；
          6 熟悉Android程序apk以及so的逆向分析流程；
          7 积极主动， 有良好的团队合作精神和较强的责任感；
        `,
        content: `
          1 负责Android平台下产品的应用程序设计、 开发、 维护。
          2 负责APP产品性能优化， 兼容性优化、 故障排查和解决安全加固， 保证App安全、 稳定、 快速运行且省电、 省流量。
          3 独立的完成设计、 制定开发计划、 开发并部署等任务。
          4 根据产品运营反馈， 改进产品， 提升用户体验。
        `
      },
      {
        label: 'iOS开发工程师',
        count: 6,
        payfor: '10-20k',
        site: '武汉',
        category: 3,
        require: `
          1、 大专及以上学历， 计算机或相关专业优先
          2、 三年及以上iOS手机应用实际开发经验；
          3、 精通iOS中的UI、 网络请求、 数据库、 XML / JSON解析等开发技巧；
          4、 熟悉iOS SDK， 具有良好的网络通信， 多线程编程经验， 熟悉性能优化；
          5、 熟悉objective - c、 c以及Xcode开发环境、 CocoaTouch等框架；
          6、 有多个完整的iOS项目经验， 至少参加过俩个完整的商业级手机应用开发项目；
          7、 熟悉iPhone, iPad等移动设备特性， 深刻理解手机客户端软件开发特点；
          8、 熟练掌握MVC设计模式；
          9、 熟练掌握第三方SDK导入、 配置及使用。
        `,
        content: `
          1、 负责iOS平台下iPhone、 iPad等产品的应用程序设计、 开发、 维护。
          2、 负责APP产品性能优化， 兼容性优化、 故障排查和解决安全加固， 保证App安全、 稳定、 快速运行且省电、 省流量。
          3、 独立的完成设计、 制定开发计划、 开发并部署等任务。
          4、 根据产品运营反馈， 改进产品， 提升用户体验。
        `
      },
      {
        label: 'Cocos客户端工程师',
        count: 2,
        payfor: '8-15k',
        site: '武汉',
        category: 3,
        require: `
          1. 本科及以上学历， 一年以上Cocos Creator开发经验， 有优秀上线作品者优先；
          2. 熟悉Cocos Creator或cocos2d - js开发游戏的完整流程， 熟悉预制体、 UI组件；
          3. 熟悉网络通信, 熟悉WebSocket协议和HTTP协议；
          4. 有支付 / 文件操作等基本功能的Android / IOS平台原生开发经验;
          5. 编写高质量代码, 按照需求实现游戏相应的系统；
        `,
        content: `
          1. 使用cocos creator 2.1 以上版本游戏引擎开发跨平台游戏；
          2. 根据需求进行功能设计, 以及程序设计、 开发、 优化工作；
          3. 负责游戏客户端相关逻辑设计及开发， 和策划、 美术沟通并能独立完成游戏功能模块的开发；
          4. 发布游戏至IOS, Android, Web等平台；
          5. 有棋牌开发经验优先。
        `
      },
      {
        label: 'JAVA后端开发工程师',
        count: 2,
        payfor: '10-20k',
        site: '武汉',
        category: 3,
        require: `
          1. 本科及以上学历， 三年以上Java开发经验；
          2. Java基础扎实, 熟练掌握JDK常用类库的使用方法；
          3., 熟悉WebSocket协议和HTTP协议， 对多线程、 异步有深刻的理解；
          4. 有微服务、 分布式开发思维， 有快速学习和运用新框架的能力。
          5. 掌握nginx、 mysql、 redis等技术， 有实战经验;
          6. 热爱技术， 对新技术抱有好奇心， 有较强的学习动力， 如了解JDK11以上版本;
          7. 编写高质量代码, 按照需求实现项目相应的系统；
        `,
        content: `
          1. 负责Java逻辑服务端和管理系统的设计和开发；；
          2. 参与技术难题攻关， 持续提升系统在高并发处理能力和稳定性；
          3. 负责产品的部署、 维护和开发；
          4. 有棋牌开发经验优先。
        `
      }
    ]
  }
}