<template>
  <section class='my-page'>
    <section class="art-wrapper">
      <h3 class="art-wrapper__title">SquRab（方兔）隐私政策</h3>

      <article class="art-wrapper__content">
        <p class="p-row">方兔（以下或称为“我们”）尊重并保护用户信息，并且将以高度勤勉和审慎的义务对待这些信息。在您使用了方兔提供的服务时，我们将按照本隐私权政策收集、处理及披露您的信息。我们希望通过本隐私权政策向您清晰地介绍我们对您信息的处理方式，因此我们建议您完整地阅读本隐私权政策，以帮助您了解维护自己隐私权的方式。
                          如果您有任何疑问、意见或建议，请通过方兔提供的各种联系方式与我们联系。
                          本政策将帮助您了解以下内容：
        </p>
        <ul class="art-wrapper__content--list">
          <li>本协议的适用范围</li>
          <li>我们如何收集和使用您的用户信息</li>
          <li>我们如何共享、转让、公开披露您的用户信息</li>
          <li>用户业务数据和公开信息</li>
          <li>您如何管理您的用户信息</li>
          <li>我们如何使用cookie和同类技术</li>
          <li>我们如何保护和保存您的用户信息</li>
          <li>未成年人用户信息的特别约定</li>
          <li>隐私权政策的更新</li>
          <li>如何联系我们</li>
        </ul>
      </article>

      <article class="art-wrapper__content">
        <h4 class="c-title"> 一、本协议的适用范围</h4>
        <p class="p-line">1.1.&nbsp;&nbsp;本隐私权政策适用于方兔网站所有服务。服务包括向您提供页面浏览、网站登录服务，以及通过方兔网站向您提供的技术服务。</p>
        <p class="p-line">1.2.&nbsp;&nbsp;本隐私权政策不适用于其他第三方向您提供的服务。</p>
        <p class="p-line">1.3.&nbsp;&nbsp;需要特别说明的是，作为方兔的用户，若您利用方兔的技术服务，为您的用户再行提供服务，因您的业务数据属于您所有，您应当另行与您的用户约定隐私权政策。</p>
      </article>

      <article class="art-wrapper__content">
        <h4 class="c-title">二、我们如何收集和使用您的用户信息</h4>
        <h5 class="s-title">（一）我们收集您的用户信息的情形</h5>
        <h6 class="l-title">2.1.帮助您成为我们的会员</h6>
        <p class="p-line">2.1.1. 当您在方兔网站创建账户时，您须向我们提供会员名，设置、确认您的登录密码，提供您在中华人民共和国境内手机号码。您提交的手机号码用于您注册、登录、绑定账户、密码找回时接受验证码，并且作为您与方兔指定的联系方式之一，用来接受相关业务通知（如新品上线、服务变更等）</p>
        <p class="p-line">2.1.2.  在您注册完成方兔账户后，您可以在账户“基本资料”一栏中继续填写您的信息，包括（1）您的会员身份类型（个人、企业）、单位名称（如果您已完成实名认证，单位名称将会以您的实名认证信息为准）、营业年限、企业规模、从事行业、主营业务、主要产品、网站域名;（2）联系信息（国家、所在地区、街道、联系电话、传真）。您若不提供这些信息，将不会影响您对某一具体技术服务的使用。您提供的本条第（1）类信息，会帮助我们更了解您对于方兔服务需求，以便方兔有针对性的向您推广、介绍产品；您提供的本条第（2）类信息，方兔可能会利用如上方式向您推广、宣传产品、邮寄业务通知（含账单）或与您进行业务沟通。</p>
        <p class="p-line">2.1.3. 在您注册完成方兔账户后，您需在账号的管理控制台提交联系人信息，包括您指定联系人的邮箱、手机号码以及联系人的职位。方兔将通过如上信息向您推广、介绍产品，发送业务通知（含账单）或与您进行业务沟通。</p>
        <p class="p-line">2.1.4. 如果您仅需使用方兔网站的浏览、搜索等基本服务，您不需要注册成为我们的会员及提供上述信息。</p>

        <h6 class="l-title">2.2.向您提供技术服务</h6>
        <p class="p-line">2.2.1.根据中华人民共和国法律，在您使用具体的技术服务时，您应通过您的账号提供您的真实身份信息。您通过方兔账号提供真实身份信息的，方兔为您提供了多种方式以协助您提供信息，您应根据您的身份属性选择适合的方式。如您通过企业对公账号方式进行实名认证的，您需向方兔提交您的企业注册地区、企业性质、企业名称和营业执照注册号，以及银行账户信息（包括开户行、银行账号和开户人）。方兔将以您提交的企业注册地区、企业性质、企业名称和营业执照注册号确认您的实名信息，方兔仅将您提供的银行账户信息（包括开户行、银行账号和开户人）作为实名认证时的打款账号。如果您通过人脸识别来进行实名认证的，您需要向我们提供面部特征的生物识别信息和您身份证正、反面照片。</p>
        
        <h6 class="l-title">2.2.2.在您使用服务过程中我们会收集以下的信息：</h6>
        <p class="p-line">2.2.2.1.设备信息：我们会根据您在软件安装及使用中授予的具体权限，接收并记录您所使用的设备相关信息（例如设备型号、操作系统版本、设备设置、唯一设备标识符等软硬件特征信息）、设备所在位置相关信息（例如IP地址、GPS位置以及能够提供相关信息的Wi-Fi接入点、蓝牙和基站等传感器信息）。我们可能会将前面两类信息进行关联，以便我们能在不同设备上为您提供一致的服务。</p>
        <p class="p-line">2.2.2.2.日志信息：当您使用我们的网站或客户端提供的服务时，我们会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。例如您的搜索查询内容、IP地址、浏览器的类型、电信运营商、使用的语言、访问日期和时间及您访问的网页记录等。</p>
        <p class="p-line">2.2.2.3.用户账户的支持信息：基于您使用方兔服务而产生的用户的咨询记录、报障记录和针对用户故障的排障过程（如通信或通话记录），方兔将通过记录、分析这些信息以便更及时响应您的帮助请求，以及用于改进服务。</p>
        <p class="p-line">2.2.3.4.我们在向您提供业务功能或具体服务时，我们会按照本政策以及相应的产品服务协议的约定收集、使用、存储、对外提供及保护您的用户信息；超出本政策以及相应的产品服务协议约定收集您的用户信息的，我们会另行向您说明信息收集的范围与目的，并征得您的同意后方收集提供相应服务所必要的您的信息；如您选择不提供前述信息，将会影响到您使用相应产品，但不会影响您使用方兔网站基本功能和其他产品。</p>

        <h5 class="s-title">（二）我们使用您的用户信息的情形</h5>
        <h6 class="l-title">2.3.我们出于如下目的，使用您提交以及我们收集的用户信息：</h6>
        <p class="p-line">2.3.1. 为了向您提供服务，我们会向您发送信息、通知或与您进行业务沟通，包括但不限于为保证服务完成所必须的验证码、使用服务时所必要的推送通知；</p>
        <p class="p-line">2.3.2. 为了维护、改进服务，向您提供更符合您个性化需求的信息展示，我们可能将来自方兔网站某项服务的用户信息与来自其他项服务的信息结合起来，做出特征模型并进行用户画像，向您展示、推送信息和可能的商业广告，包括但不限于关于方兔产品的新闻以及市场活动及优惠促销信息、方兔合作第三方的推广信息，或其他您可能感兴趣的内容。如果您不想接收我们给您发送的商业性电子信息，您可通过短信提示回复退订或根据信息中提供的退订方式予以退订；</p>
        <p class="p-line">2.3.3. 我们可能以用户信息统计数据为基础，设计、开发、推广全新的产品及服务；我们会对我们的服务使用情况进行统计，并可能会与公众或第三方分享这些统计信息，但这些统计信息不包含您的任何身份识别信息；</p>
        <p class="p-line">2.3.4. 为提高您使用我们及我们关联公司、合作伙伴提供服务的安全性，确保操作环境安全与识别账号异常状态，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或方兔相关协议、规则的情况，我们可能使用您的会员信息、并整合设备信息、有关网络日志以及我们关联公司、合作伙伴合法分享的信息，来判断您账户及交易风险、进行身份验证、安全事件的检测及防范，并依法采取必要的记录、审计、分析、处置措施；</p>
        <p class="p-line"> 2.3.5. 如超出收集用户信息时所声称的目的，或者在超出具有直接或合理关联的范围使用用户信息前，我们会再次向您告知并征得您的明示同意。</p>
      </article>

      <article class="art-wrapper__content">
        <h4 class="c-title">三、我们如何共享、转让、公开披露您的用户信息</h4>
        <h5 class="s-title">3.1. 共享</h5>
        <p class="p-line">我们不会与其他组织和个人共享您的用户信息，但以下情况除外：</p>
        <p class="p-line">3.1.1.在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的用户信息；</p>
        <p class="p-line">3.1.2.在法定情形下的共享：我们可能会根据法律法规规定、诉讼、仲裁解决需要，或按行政、司法机关依法提出的要求，对外共享您的用户信息；</p>
        <p class="p-line">3.1.3.为了促成交易或协助解决争议，某些情况下只有共享您的用户信息，才能促成交易或处理您与他人的纠纷或争议；</p>
        <p class="p-line"> 3.1.4.与授权合作伙伴共享：我们可能委托受信赖的合作伙伴来提供服务，因此我们可能会与合作伙伴共享您的某些用户信息，以提供更好的客户服务和优化用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的用户信息，并且只会共享提供服务所必要的用户信息。我们的合作伙伴无权将共享的用户信息用于任何其他用途。
            目前，我们的授权合作伙伴包括如下类型：供应商、服务提供商和其他合作伙伴。我们将信息发送给支持我们业务的供应商、服务提供商和其他合作伙伴，这些支持包括提供基础技术服务、提供咨询、分析等专业服务。
            对我们与之共享用户信息的公司、组织和个人，我们会与其签署严格的保密协议以及信息保护约定，要求他们按照我们的说明、本隐私权政策以及其他任何相关的保密和安全措施来处理用户信息。</p>

        <h5 class="s-title">3.2. 转让</h5>
        <p class="p-line">我们不会将您的用户信息转让给任何公司、组织和个人，但以下情况除外：</p>
        <p class="p-line">3.2.1. 在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的用户信息；</p>
        <p class="p-line">3.2.2. 在方兔与其他法律主体者发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到用户信息转让，我们会要求新的持有您用户信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。</p>

        <h5 class="s-title">3.3. 公开披露</h5>
        <p class="p-line">我们仅会在以下情况下，公开披露您的用户信息：</p>
        <p class="p-line">3.3.1． 获得您明确同意或基于您的主动选择，我们可能会公开披露您的用户信息；</p>
        <p class="p-line">3.3.2. 或为保护方兔平台及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据适用的法律或方兔平台相关协议、规则披露关于您的用户信息。例如，若您作为云市场服务商销售假货或盗版商品，我们可能会公开披露您的店铺主体信息与处罚情况。</p>

        <h5 class="s-title">3.4. 共享、转让、公开披露用户信息时事先征得授权同意的例外</h5>
        <p class="p-line">以下情形中，共享、转让、公开披露您的用户信息无需事先征得您的授权同意：</p>
        <p class="p-line">3.4.1. 与国家安全、国防安全有关的；</p>
        <p class="p-line">3.4.2. 与公共安全、公共卫生、重大公共利益有关的；</p>
        <p class="p-line">3.4.3. 与犯罪侦查、起诉、审判和判决执行等有关的；</p>
        <p class="p-line">3.4.4. 出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</p>
        <p class="p-line">3.4.5. 您自行向社会公众公开的个人信息</p>
        <p class="p-line">3.4.6.从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。</p>
      </article>

      <article class="art-wrapper__content">
        <h4 class="c-title">四、用户业务数据和公开信息</h4>
        <strong>不同于您的用户信息，对于用户业务数据和公开信息，方兔将按如下方式处理：</strong>
        <h5 class="s-title">4.1. 用户业务数据</h5>
        <p class="p-line">4.1.1. 您通过方兔提供的服务，加工、存储、上传、下载、分发以及通过其他方式处理的数据，均为您的用户业务数据，您完全拥有您的用户业务数据。方兔作为云服务提供商，我们只会严格执行您的指示处理您的业务数据，除按与您协商一致或执行明确的法律法规要求外，不对您的业务数据进行任何非授权的使用或披露。</p>
        <p class="p-line">4.1.2. 您应对您的用户业务数据来源及内容负责，方兔提示您谨慎判断数据来源及内容的合法性。因您的用户业务数据内容违反法律法规、部门规章或国家政策而造成的全部结果及责任均由您自行承担。</p>
        <p class="p-line">4.1.3. 根据您与方兔协商一致，方兔在您选定的数据中心存储用户业务数据。方兔恪守对用户的安全承诺，根据适用的法律保护用户存储在方兔数据中心的数据。</p>

        <h5 class="s-title">4.2. 公开信息</h5>
        <p class="p-line">4.2.1. 公开信息是指您公开分享的任何信息，任何人都可以在使用和未使用方兔网站服务期间查看或访问这些信息。例如您在方兔开发者论坛发布的信息。</p>
        <p class="p-line">4.2.2. 为使用方兔网站服务，可能存在您必须公开分享的信息。</p>
      </article>

      <article class="art-wrapper__content">
        <h4 class="s-title">五、您如何管理您的用户信息</h4>
        <p class="p-line">5.1.您可以登录方兔网站或客户端“管理控制台”查询、管理（变更、删除）使用方兔服务时而提交的基本业务信息（基本资料）和联系人信息。</p>
        <p class="p-line">5.2.如果您需要变更您方兔账户的实名认证信息，您需通过工单、电话等方式联系方兔，按照方兔的操作文档进操作；</p>
        <p class="p-line">5.3.在以下情形中，您可以向我们提出删除用户信息的请求：</p>
        <p class="p-line">5.3.1.如果我们处理用户信息的行为违反法律法规；</p>
        <p class="p-line">5.3.2.如果我们收集、使用您的用户信息，却未征得您的明确同意；</p>
        <p class="p-line">5.3.3.如果我们处理个人信息的行为严重违反了与您的约定。为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。</p>
        <p class="p-line">
          5.4 每个业务功能需要一些基本的用户信息才能得以完成（见本隐私权政策第二条）。除此之外，您可以在与方兔客服联系给予或收回您的授权同意。当您收回同意后，我们将不再处理相应的用户信息。
          <strong>但您收回同意的决定，不会影响此前基于您的授权而开展的用户信息处理。</strong>
        </p>
        <p class="p-line">5.5 您也可以自行在方兔网站“注销账号”页面（“管理控制台-账号管理-安全设置-注销账号”）提交账户注销申请。在您主动删除用户信息之后，我们将停止为您提供产品或服务，根据适用法律的要求删除您的用户信息。</p>
      </article>

      <article class="art-wrapper__content">
        <h4 class="c-title">六、我们如何使用Cookie 和同类技术</h4>
        <p class="p-line">6.1.为确保网站正常运转、为您获得更轻松的访问体验、向您推荐您可能感兴趣的内容，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。方兔只能读取方兔提供的cookies。</p>
        <p class="p-line">6.2.借助于 Cookie，能够存储您的偏好或购买清单中的商品等数据。当下一次您再次访问的时候，我们将显示您需要的信息；或由方兔通过cookies文件来辨识您的来源网站，以便方兔能追踪方兔的广告效果。</p>
        <p class="p-line">6.3.您可根据自己的偏好管理Cookie，您也可以清除计算机上保存的所有 Cookie。大部分网络浏览器都设有阻止 Cookie 的功能。但如果您这么做，则需要在每一次访问我们的网站时更改用户设置。如需详细了解如何更改浏览器设置，请访问您使用的浏览器的相关设置页面。</p>
        <p class="p-line">6.4.除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的地址链接，如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好以便于我们主动改善客户服务体验。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。</p>
      </article>

      <article class="art-wrapper__content">
        <h4 class="c-title">七、我们如何保护和保存您的用户信息</h4>
        <p class="p-line">7.1.方兔非常重视您的信息安全。我们努力采取各种合理的物理、电子和管理方面的安全措施来保护您的用户信息。防止用户信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会使用加密技术提高用户信息的安全性；我们会使用受信赖的保护机制防止用户信息遭到恶意攻击；我们会部署访问控制机制，尽力确保只有授权人员才可访问用户信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护用户信息重要性的认识。</p>
        <p class="p-line">
          <strong>7.2.我们会采取合理可行的措施，尽力避免收集无关的用户信息。我们只会在达成本政策所述目的所需的期限内保留您的用户信息，除非受到法律的允许。超出上述用户信息保存期限后，我们会对您的个人信息进行删除或匿名化处理。</strong>
        </p>
        <p class="p-line">7.3.请使用复杂密码，协助我们保证您的账号安全。我们将尽力保障您发送给我们的任何信息的安全性。如果我们的物理、技术或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。</p>
        <p class="p-line">7.4.在不幸发生用户信息安全事件（泄露、丢失等）后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知用户信息主体时，我们会采取合理、有效的方式发布公告。</p>
        <p class="p-line">7.5.同时，我们还将按照监管部门要求，上报用户信息安全事件的处置情况。</p>
        <p class="p-line">7.6.我们将收集到的您的用户信息存放在中华人民共和国境内，如在符合适用法律规定的情形下因业务需要向境外传输个人信息的，我们会事先征得您的同意，并向您告知用户信息出境的目的、接收方、安全保障措施、安全风险等情况。</p>
        <p class="p-line"> 7.7.如出现方兔产品和服务停止运营的情形，我们会采取合理措施保护您用户信息安全，包括及时停止继续收集用户信息的活动；停止运营的通知将以逐一送达或公告的形式通知用户；并对所持有的个人信息进行删除或匿名化处理等</p>
      </article>

      <article class="art-wrapper__content">
        <h4 class="c-title">八、未成年人用户信息的特别约定</h4>
        <p class="p-line">
          <strong> 8.1. 我们主要面向成人提供产品和服务。如您为未成年人，我们要求您请您的父母或监护人仔细阅读本隐私权政策，并在征得您的父母或监护人同意的前提下使用我们的服务或向我们提供信息。</strong>
        </p>
        <p class="p-line"> 8.2.对于经父母或监护人同意使用我们的产品或服务而收集未成年人个人信息的情况，我们只会在法律法规允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用、共享、转让或披露此信息。</p>
      </article>
    
      <article class="art-wrapper__content">
        <h4 class="c-title">九、隐私权政策的更新</h4>
        <p class="p-line">9.1.我们的隐私权政策可能修订。</p>
        <p class="p-line">9.2.未经您明确同意，我们不会限制您按照本隐私权政策所应享有的权利。</p>
        <p class="p-line">9.3.对于重大修订，我们还会提供更为显著的通知（包括对于某些服务，我们会通过网站公示的方式进行通知甚至向您提供弹窗提示，说明隐私权政策的具体变更内容）。</p>
        
        <h5 class="s-title">9.4.本政策所指的重大变更包括但不限于：</h5>
        <p class="p-line">9.4.1.我们的服务模式发生重大变化。如处理用户信息的目的、处理的用户信息类型、用户信息的使用方式等；</p>
        <p class="p-line">9.4.2.我们在控制权、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；</p>
        <p class="p-line">9.4.3.用户信息共享、转让或公开披露的主要对象发生变化；</p>
        <p class="p-line">9.4.4.您参与用户信息处理方面的权利及其行使方式发生重大变化；</p>
        <p class="p-line">9.4.5.我们负责处理用户信息安全的责任部门、联络方式及投诉渠道发生变化时；</p>
        <p class="p-line">9.4.6.用户信息安全影响评估报告表明存在高风险时。</p>
        <p class="p-line">我们还会将本隐私权政策的历史版本在网站专门页面存档，供您查阅。</p>
      </article>

      <article class="art-wrapper__content">
        <h4 class="c-title"> 十、如何联系我们</h4>
        <p class="p-line">您对本声明和政策内容有任何疑问和意见，或者您对方兔对本隐私权政策的实践以及操作上有任何疑问和意见，您可通过方兔的客服电话（4008-588-855）与我们联系。</p>
      </article>
    </section>
  </section>
</template>

<script>
 export default{
  name: 'FooterSelf',
  components: {},
  props: {},
  watch: {},
  computed: {},
  data(){
    return {
    }
  },
  methods: {},
  created(){},
  mixins: []
 }
</script>

<style scoped lang='scss'>
@import '@/assets/style/mixin.scss';
@import '@/assets/style/color.scss';
.my-page {
  width: inherit;
  .art-wrapper {
    width: inherit;
    &__title {
      padding: 50px 0;
      font-size: $--font-size-large * 2;
      text-align: center;
      box-sizing: border-box;
    }
    &__content {
      padding: 0 20px 20px;
      font-size: $--font-size-middle;
      .p-row {
        text-indent: 2em;
        line-height: 1.5em;
        font-size: $--font-size-large;
        font-weight: $--font-weight-bold;
      }

      &--list {
        font-weight: $--font-weight-bold;
        & > li {
          height: 2em;
          line-height: 2em;
        }
      }

      h4.c-title {
        font-size: $--font-size--extra-large;
        line-height: $--line-default;
      }
      h5.s-title {
        font-size: $--font-size-large;
        line-height: $--line-default;
      }
      h6.l-title {
        font-size: $--font-size-middle;
        font-weight: $--font-weight-bold;
        line-height: $--line-default;
      }
      .p-line {
        font-size: $--font-size-middle;
        line-height: $--line-default;
        text-indent: $--text-indent-small;
      }
    }
  }
}

ul.art-wrapper__content--list,
ul.art-wrapper__content--list li {
  list-style-type: korean-hanja-informal;
  list-style-position: inside;
}
</style>